<?php
/*
 * Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К»
 */

$country = [
    'Московская область' => [
        'Москва',
        'Зеленоград',
        'Клин'
    ],
    'Ленинградская область' => [
        'Санкт-Петербург',
        'Всеволожск',
        'Павловск',
        'Кронштадт'
    ],
    'Рязанская область' => [
        'Рязань',
        'Касимов',
        'Скопин'
    ]
];

foreach ($country as $region => $city) {
    echo "{$region}: <br>";

    if (is_array($city)) {
        for ($i = 0; $i < count($city); $i++) {
            $city_a = preg_split('//u', $city[$i], -1, PREG_SPLIT_NO_EMPTY);

            if (mb_strtolower($city_a[0]) == 'к') {

                echo "{$city[$i]}<br>";

            }
        }

    } else {
        echo "{$city},";
    }
}